app/controllers/line_items_controller.rb

   def create
      @cart = current_cart
      product = Product.find params[:product_id]
      @line_item = @cart.add_product(product.id)

      respond_to do |format|
         if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = 1 ORDER BY title LIMIT 1
INSERT INTO "carts" ("created_at", "updated_at") VALUES ('2011-05-07 04:44:51.405273', '2011-05-07 04:44:51.405273')
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at", "quantity") VALUES (7, 3, '2011-05-07 05:15:54.413085', '2011-05-07 05:15:54.413085', 1)
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2011-05-07 05:06:35.851562' WHERE "line_items"."id" = 2