app/controllers/store_controller.rb

   def index
#      @products = Product.all
      @products = Product.paginate :page => params[:page], :order => 'created_at DESC'
---
SELECT "products".* FROM "products" ORDER BY title, created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM "products"